---
kind: type
id: T:Autodesk.Revit.DB.LinePatternSegment
source: html/93ef103b-5ef6-054c-d5c5-8d2b5dc68b12.htm
---
# Autodesk.Revit.DB.LinePatternSegment

Represents a segment in a line pattern.

## Syntax (C#)
```csharp
public class LinePatternSegment : IDisposable
```